extends HTTPRequest
# docstring 文档说明


################################################################
# Signals 信号
################################################################

################################################################
# Enums 枚举
################################################################

################################################################
# Constants 常量
################################################################
const DEFAULT_HEADERS = [
	"Content-Type: application/json",
	"User-Agent: Mahjong Fruit Client %s" % Global.VERSION,
]

################################################################
# Exported variables 导出变量
################################################################

################################################################
# Public variables 公共变量
################################################################

################################################################
# Private variables 私有变量
################################################################

################################################################
# Onready variables 自动初始化变量
################################################################


################################################################
# built-in virtual methods 内置的虚函数
################################################################
#func _init():
#	pass


func _ready():
	pass


#func _process(delta):
#	pass


################################################################
# Public methods 公共函数
################################################################
func get_http(url: String) -> void:
	print(request(url))


################################################################
# Private methods 私有函数
################################################################
func _make_post_request(url, data_to_send, use_ssl) -> void:
	var query = JSON.print(data_to_send)
	# warning-ignore:return_value_discarded
	request(url, DEFAULT_HEADERS, use_ssl, HTTPClient.METHOD_POST, query)


################################################################
# Setter/Getter methods
################################################################


################################################################
# Callback methods 回调函数
################################################################
func _on_HTTPRequest_request_completed(result, response_code, headers, body):
	if response_code == 200:
		var json = JSON.parse(body.get_string_from_utf8())
		print(json.result)
	else:
		printerr("last request: result=%s response_code=%s headers=%s body=%s" %
				[result, response_code, headers, body])
